nitikorn20/psoc-edge-lvgl-capsense/proj_cm55/main.c
    /* Create the FreeRTOS Task */
    task_return = xTaskCreate(cm55_gfx_task, GFX_TASK_NAME,
                              GFX_TASK_STACK_SIZE, NULL,
                              GFX_TASK_PRIORITY, &rtos_cm55_gfx_task_handle);

    /* ANSI ESC sequence for clear screen */
    printf("\x1b[2J\x1b[;H");

    if (pdPASS == task_return)
    {
        printf("****************** "
               "PSOC Edge MCU: Graphics LVGL Demo "
               "****************** \r\n\n");

        /* Start the RTOS Scheduler */
        vTaskStartScheduler();

        /* Should never get here! */
        handle_app_error();
    }
    else
    {
        printf("Error: Failed to create cm55_gfx_task.\r\n");
        handle_app_error();
    }
}

static void app_ui_init(void)
{
    lv_obj_t *scr = lv_screen_active();
    capsense_label = lv_label_create(scr);
    lv_label_set_text(capsense_label, "CAPSENSE: none");
    lv_obj_align(capsense_label, LV_ALIGN_TOP_LEFT, 10, 10);
}

static void app_ui_update(const capsense_event_t *event)
{
    static char text[48];

    if ((capsense_label == NULL) || (event == NULL))
    {
        return;
    }

    switch (event->type)
    {
        case CAPSENSE_EVENT_BTN0:
            (void)snprintf(text, sizeof(text), "CAPSENSE: BTN0");
            break;
        case CAPSENSE_EVENT_BTN1:
            (void)snprintf(text, sizeof(text), "CAPSENSE: BTN1");
            break;
        case CAPSENSE_EVENT_SLIDER:
            (void)snprintf(text, sizeof(text), "CAPSENSE: SLIDER=%u",
                           (unsigned int)event->slider);
            break;
        default:
            (void)snprintf(text, sizeof(text), "CAPSENSE: none");
            break;
    }

    lv_label_set_text(capsense_label, text);
}


/* [] END OF FILE */
